In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("data/SF_salary_data_gender.csv")
df

C:\Users\hani4\AppData\Local\Temp\ipykernel_25756\2288432797.py:1: DtypeWarning: Columns (4,5,6,7,13) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("data/SF_salary_data_gender.csv")

,Unnamed: 0,Id,Employee Name,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,gender
0,0,1,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,m
1,1,2,gary jimenez,captain iii (police department),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,m
2,2,3,albert pardini,captain iii (police department),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,m
3,3,4,christopher chong,wire rope cable maintenance mechanic,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,m
4,4,5,patrick gardner,"deputy chief of department,(fire department)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,m
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148649,148650,roy i,custodian,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,PT,m
148650,148650,148651,not provided,not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN,m
148651,148651,148652,not provided,not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN,m
148652,148652,148653,not provided,not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN,m
148653,148653,148654,joe lopez,"counselor, log cabin ranch",0,0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT,m

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 15 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        148654 non-null  int64
 1   Id                148654 non-null  int64
 2   Employee Name     148653 non-null  object
 3   JobTitle          148654 non-null  object
 4   BasePay           148049 non-null  object
 5   OvertimePay       148654 non-null  object
 6   OtherPay          148654 non-null  object
 7   Benefits          112495 non-null  object
 8   TotalPay          148654 non-null  float64
 9   TotalPayBenefits  148654 non-null  float64
 10  Year              148654 non-null  int64
 11  Notes             0 non-null       float64
 12  Agency            148654 non-null  object
 13  Status            38119 non-null   object
 14  gender            119169 non-null  object
dtypes: float64(3), int64(3), object(9)
memory usage: 17.0+ MB

In [7]:
df.describe()

,Unnamed: 0,Id,TotalPay,TotalPayBenefits,Year,Notes
count,148654.000000,148654.000000,148654.000000,148654.000000,148654.000000,0.0
mean,74326.500000,74327.500000,74768.321972,93692.554811,2012.522643,NaN
std,42912.857795,42912.857795,50517.005274,62793.533483,1.117538,NaN
min,0.000000,1.000000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.250000,37164.250000,36168.995000,44065.650000,2012.000000,NaN
50%,74326.500000,74327.500000,71426.610000,92404.090000,2013.000000,NaN
75%,111489.750000,111490.750000,105839.135000,132876.450000,2014.000000,NaN
max,148653.000000,148654.000000,567595.430000,567595.430000,2014.000000,NaN

In [8]:
df.head()

,Unnamed: 0,Id,Employee Name,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,gender
0,0,1,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,m
1,1,2,gary jimenez,captain iii (police department),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,m
2,2,3,albert pardini,captain iii (police department),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,m
3,3,4,christopher chong,wire rope cable maintenance mechanic,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,m
4,4,5,patrick gardner,"deputy chief of department,(fire department)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,m

In [9]:
df['TotalPay'].mean()

74768.321971703

In [10]:
df['TotalPay'].max()

567595.43

In [11]:
df['Employee Name'] == 'albert pardini'

0         False
1         False
2          True
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: Employee Name, Length: 148654, dtype: bool

In [12]:
df[df['Employee Name'] == 'albert pardini']

,Unnamed: 0,Id,Employee Name,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,gender
2,2,3,albert pardini,captain iii (police department),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,m
36519,36519,36520,albert pardini,captain 3,196265.04,0.0,11404.04,46326.21,207669.08,253995.29,2012,NaN,San Francisco,NaN,m

In [13]:
df[df['Employee Name'] == 'albert pardini'] ['JobTitle']

2        captain iii (police department)
36519                          captain 3
Name: JobTitle, dtype: object

In [14]:
df[df['TotalPay'] == df['TotalPay'].max()]

,Unnamed: 0,Id,Employee Name,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,gender
0,0,1,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,m

In [15]:
df[df['TotalPay'] == df['TotalPay'].max()]['Employee Name']

0    nathaniel ford
Name: Employee Name, dtype: object

In [16]:
df[df['TotalPay'] == df['TotalPay'].min()]

,Unnamed: 0,Id,Employee Name,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,gender
148653,148653,148654,joe lopez,"counselor, log cabin ranch",0,0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT,m

In [17]:
df[df['TotalPay'] == df['TotalPay'].min()]['Employee Name']

148653    joe lopez
Name: Employee Name, dtype: object

In [18]:
df.groupby('Year').mean()

      Unnamed: 0        Id      TotalPay  TotalPayBenefits  Notes
Year
2011     18079.0   18080.0  71744.103871      71744.103871    NaN
2012     54541.5   54542.5  74113.262265     100553.229232    NaN
2013     91727.5   91728.5  77611.443142     101440.519714    NaN
2014    129592.0  129593.0  75463.918140     100250.918884    NaN

In [19]:
df.groupby('Year').mean()['TotalPay']

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [20]:
df['JobTitle'].nunique()

1637

In [21]:
df['JobTitle'].value_counts().head()

transit operator    9424
special nurse       5791
registered nurse    4955
custodian           3214
firefighter         3153
Name: JobTitle, dtype: int64

In [22]:
df['JobTitle'].value_counts().head(10)

transit operator                9424
special nurse                   5791
registered nurse                4955
custodian                       3214
firefighter                     3153
recreation leader               2663
deputy sheriff                  2618
public svc aide-public works    2518
police officer 3                2421
patient care assistant          1945
Name: JobTitle, dtype: int64

In [23]:
df['JobTitle'].value_counts().tail(10)

assistant director of clinical services i             1
cashier iii                                           1
legislative assistant, city attorney's office         1
shelter office assistant supervisor                   1
power house electrician supervisor i                  1
executive assistant to the general manager, retire    1
animal care assistant supervisor                      1
media/security systems supervisor                     1
chief microbiologist                                  1
secretary,juvenile probation commission               1
Name: JobTitle, dtype: int64

In [24]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

In [25]:
def chief(string):
    if 'chief' in (string.lower()):
        return True
    else:
        return False

In [26]:
chief('chief manager-metropolitan transit authority')

True

In [31]:
chief(' manager-metropolitan transit authority')

False

In [27]:
df['JobTitle'].apply(lambda x: chief(x))

0         False
1         False
2         False
3         False
4          True
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [28]:
(df['JobTitle'].apply(lambda x: chief(x))).sum()

627

In [29]:
df['ntitles'] = df['JobTitle'].apply(len)
df['ntitles']

0         46
1         31
2         31
3         36
4         44
          ..
148649     9
148650    12
148651    12
148652    12
148653    26
Name: ntitles, Length: 148654, dtype: int64

In [30]:
df[['ntitles', 'TotalPayBenefits']].corr()

                   ntitles  TotalPayBenefits
ntitles           1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000